espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/hp_peri_pms_struct.h
/** Type of coren_um_hp_peri_pms_reg3 register
 *  Permission control register3 for HP CPUn in user mode
 */
typedef union {
    struct {
        /** coren_um_hp_gpio_allow : R/W; bitpos: [0]; default: 1;
         *  Configures whether HP CPUn in user mode has permission to access HP GPIO Matrix.
         *  0: Not allowed
         *  1: Allowed
         */
        uint32_t coren_um_hp_gpio_allow:1;
        /** coren_um_hp_iomux_allow : R/W; bitpos: [1]; default: 1;
         *  Configures whether HP CPUn in user mode has permission to access HP IO MUX.
         *  0: Not allowed
         *  1: Allowed
         */
        uint32_t coren_um_hp_iomux_allow:1;
        /** coren_um_hp_systimer_allow : R/W; bitpos: [2]; default: 1;
         *  Configures whether HP CPUn in user mode has permission to access HP system timer.
         *  0: Not allowed
         *  1: Allowed
         */
        uint32_t coren_um_hp_systimer_allow:1;
        /** coren_um_hp_sys_reg_allow : R/W; bitpos: [3]; default: 1;
         *  Configures whether HP CPUn in user mode has permission to access HP system
         *  register.
         *  0: Not allowed
         *  1: Allowed
         */
        uint32_t coren_um_hp_sys_reg_allow:1;
        /** coren_um_hp_clkrst_allow : R/W; bitpos: [4]; default: 1;
         *  Configures whether HP CPUn in user mode has permission to access HP_SYS_CLKRST.
         *  0: Not allowed
         *  1: Allowed
         */
        uint32_t coren_um_hp_clkrst_allow:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} pms_coren_um_hp_peri_pms_reg3_reg_t;

/** Group: TEE Peripheral Permission Control Register */
/** Type of regdma_hp_peri_pms register
 *  HP Peripheral Permission register for REGDMA
 */
typedef union {
    struct {
        /** regdma_peri_hp_peri_allow : R/W; bitpos: [0]; default: 1;
         *  Configures whether REGDMA has permission to access  all HP peripherals.
         *  0: Not allowed
         *  1: Allow
         */
        uint32_t regdma_peri_hp_peri_allow:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} pms_regdma_hp_peri_pms_reg_t;

typedef struct {
    volatile pms_hp_peri_pms_date_reg_t hp_peri_pms_date;
    volatile pms_hp_peri_pms_clk_en_reg_t hp_peri_pms_clk_en;
    volatile pms_coren_mm_hp_peri_pms_reg0_reg_t core0_mm_hp_peri_pms_reg0;
    volatile pms_coren_mm_hp_peri_pms_reg1_reg_t core0_mm_hp_peri_pms_reg1;
    volatile pms_coren_mm_hp_peri_pms_reg2_reg_t core0_mm_hp_peri_pms_reg2;
    volatile pms_coren_mm_hp_peri_pms_reg3_reg_t core0_mm_hp_peri_pms_reg3;
    volatile pms_coren_um_hp_peri_pms_reg0_reg_t core0_um_hp_peri_pms_reg0;
    volatile pms_coren_um_hp_peri_pms_reg1_reg_t core0_um_hp_peri_pms_reg1;
    volatile pms_coren_um_hp_peri_pms_reg2_reg_t core0_um_hp_peri_pms_reg2;
    volatile pms_coren_um_hp_peri_pms_reg3_reg_t core0_um_hp_peri_pms_reg3;
    volatile pms_coren_mm_hp_peri_pms_reg0_reg_t core1_mm_hp_peri_pms_reg0;
    volatile pms_coren_mm_hp_peri_pms_reg1_reg_t core1_mm_hp_peri_pms_reg1;
    volatile pms_coren_mm_hp_peri_pms_reg2_reg_t core1_mm_hp_peri_pms_reg2;
    volatile pms_coren_mm_hp_peri_pms_reg3_reg_t core1_mm_hp_peri_pms_reg3;
    volatile pms_coren_um_hp_peri_pms_reg0_reg_t core1_um_hp_peri_pms_reg0;
    volatile pms_coren_um_hp_peri_pms_reg1_reg_t core1_um_hp_peri_pms_reg1;
    volatile pms_coren_um_hp_peri_pms_reg2_reg_t core1_um_hp_peri_pms_reg2;
    volatile pms_coren_um_hp_peri_pms_reg3_reg_t core1_um_hp_peri_pms_reg3;
    volatile pms_regdma_hp_peri_pms_reg_t regdma_hp_peri_pms;
} hp_peri_pms_dev_t;

extern hp_peri_pms_dev_t HP_PERI_PMS;

#ifndef __cplusplus
_Static_assert(sizeof(hp_peri_pms_dev_t) == 0x4c, "Invalid size of hp_peri_pms_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
